# Определить, какие из слов «attribute», «класс», «функция», «type» невозможно записать в байтовом типе.

print('Задание 3:')

var_1 = b'attribute'
var_2 = b'класс'
var_3 = b'функция'
var_4 = b'type'

# Слова «класс» и «функция» невозможно записать в байтовом типе.
# Ошибка выполнения программы: SyntaxError: bytes can only contain ASCII literal characters.

print('=================================================')
